Repository: 84000/data-translation-memory
Catalog: toh61-v4.tmx
Source language: bo
Languages: en

source: །དེའི་ཚེ་དགེ་སློང་དྲན་པ་ཐོབ་པའི་དགེ་སློང་རྣམས་དང་། ད་མ་ཤི་རིའི་དགེ་སློང་རྣམས་ལས་གང་དགེ་བའི་རྩ་བ་ལྷུན་སྟུག་པ་དེ་དག་ནི་ཡ་ཤས་བསྟན་པའི་ཆོས་རྣམས་ཐོས་ནས་སེམས་རབ་ཏུ་དགའ་ཞིང་ཐམས་ཅད་ཀྱིས་ཆོས་ཀྱི་བདེ་བ་ཐོབ་པར་གྱུར་ཏོ།
en: “When, among all the monks following Smṛtipratilabdha and all the monks following Damaśrī, those who had created massive roots of virtue heard the teachings taught by the monk Yaśas, they became extremely pleased, and all of them experienced joy in the Dharma.

source: །གང་པོ་དགེ་སློང་མང་པོ་དེ་དག་ཡང་དག་པའི་དོན་ལ་རྟོན་ཅིང་ཚིག་གི་རྗེས་སུ་འབྲང་བར་ཀྱང་མི་བྱེད་པས་དེའི་ཕྱིར་དགེ་སློང་ཡ་ཤས་སྔོན་མ་ཐོས་པའི་མདོ་སྡེ་སྟོང་པ་ཉིད་ཀྱི་རྗེས་སུ་འཐུན་ཞིང་ཤིན་ཏུ་ཟབ་པ། དོན་དམ་པའི་རྗེས་སུ་འཐུན་པ་དག་ཡང་དག་པར་བསྟན་པ་ཐོས་པར་གྱུར་ནས་མངོན་པར་ཡིད་ཆེས་ཤིང་དང་དུ་ལེན་པར་བྱེད། འགལ་བ་མེད་པར་ཡང་དག་པར་ལེན་ཅིང་ཁ་ཏོན་དུ་འདོན་པར་བྱེད་དེ། ཇི་སྐད་བསྟན་པ་བཞིན་དུ་རྗེས་སུ་བསྒྲུབས་པར་གྱུར་ཏོ།
en: Pūrṇa, since those many monks relied on the authentic meaning and were not caught up in the words, upon hearing from the monk Yaśas those extremely profound discourses that they had never heard before and that were in harmony with emptiness and the ultimate, they developed strong trust in them, adopted them eagerly, accepted them without opposition, recited them, and practiced them in accordance with the way they were taught.

source: །གང་པོ་དགེ་སློང་དེ་དག་ལས་གང་དབང་པོ་རྟུལ་ཞིང་མི་གསལ་བ་དང་། དགེ་བའི་རྩ་བ་ལྷུན་མི་སྟུག་པ་དེ་དག་ནི་དགེ་སློང་ཡ་ཤ་ལས་སྔོན་མ་ཐོས་པའི་མདོ་སྡེ་དོན་དམ་པའི་རྗེས་སུ་འཐུན་པ། སྟོང་པ་ཉིད་ཀྱི་རྗེས་སུ་འཐུན་ཞིང་ཤིན་ཏུ་ཟབ་པ་དག་ཐོས་པར་གྱུར་ནས་མངོན་པར་ཡིད་ཆེས་ཤིང་དང་དུ་ལེན་པར་ཡང་མི་བྱེད།
en: Pūrṇa, when, among those monks, those who had dull faculties, lacked mental brilliance, and had not previously created massive roots of virtue, heard for the first time those extremely profound discourses taught by the monk Yaśas that were in harmony with emptiness and the ultimate, they did not develop any trust in them, and they did not adopt them eagerly.

source: འགལ་བ་བྱས་ནས་འཇིག་ཅིང་དམོད་པར་བྱེད་དེ།
en: Instead, they opposed them, denigrated them, and criticized them in these words:

source: འདི་སྐད་དུ་འདི་ལྟ་བུའི་ཆོས་འདི་ནི་བདག་ཅག་གིས་མཁན་པོ་དང་། སློབ་དཔོན་ལས་ཀྱང་མ་ཐོས།
en: ‘We have never heard such Dharma from preceptors or teachers.

source: སྔོན་སྟོན་པ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའ་དྲན་པ་ཐོབ་པ་ལས་ཀྱང་མ་ཐོས་སོ་ཞེས་ཟེར་རོ།
en: We have not even heard it from the great teacher of the past, the bodhisattva Smṛtipratilabdha!’

source: །གང་པོ་དེའི་ཚེ་དགེ་སློང་ཡ་ཤ་ལས་ཆོས་ཐོས་ནས་རབ་ཏུ་དགའ་བ་དང་། སེམས་ཀྱིས་མངོན་པར་ཡིད་ཆེས་ཤིང་དང་དུ་བླངས་པ་དེ་དག་ཐམས་ཅད་ནི་ད་མ་ཤི་རིའི་དགེ་སློང་རྣམས་དང་། དྲན་པ་ཐོབ་པའི་དགེ་སློང་རྣམས་ཀྱིས་སྡང་ཞིང་ཕྲག་དོག་གིས་དམད་ནས་ལྷན་ཅིག་གནས་སུ་ཡང་མི་སྟེར། ལྷན་ཅིག་ཀློག་པ་དང་། ཁ་ཏོན་འདོན་པ་དང་། ཆོས་བཤད་དུ་ཡང་མི་སྟེར་ཏེ།
en: “Pūrṇa, at that time, this latter group of monks among those who followed Damaśrī and Smṛtipratilabdha began, out of hostility and jealousy, to criticize the other monks who were utterly pleased by the teachings they had heard from the monk Yaśas and who felt strong trust in them and earnestly adopted them. They did not allow those monks to live with them, nor were they allowed to read, recite, or expound the Dharma together with them.

source: སྐུར་པ་བཏབ་ནས་འདི་སྐད་དུ་འདི་ནི་སངས་རྒྱས་ཀྱི་ཆོས་ཀྱང་མ་ཡིན། སྟོན་པ་ཆེན་པོའི་བསྟན་པ་ཡང་མ་ཡིན་ནོ་ཞེས་ཟེར་རོ།
en: Looking down on the other monks, they said, ‘This is not the Dharma of the Buddha; these are not the teachings of the great teacher!’

source: །གང་པོ་དེའི་ཚེ་དགེ་སློང་ཡ་ཤས་དེ་བཞིན་གཤེགས་པ་མེ་རོ་གན་དྷའི་བསྟན་པ་རྒྱ་ཆེར་ཡང་དག་པར་སྤེལ་ནས་གྲོང་ཁྱེར་གཅིག་ནས་གྲོང་ཁྱེར་གཅིག་ཏུ་རྒྱུ་ཞིང་སོང་ནས་སེམས་ཅན་རྣམས་ལ་ཆོས་བསྟན་ཅིང་ཕན་པ་མང་པོ་བྱས་པས་སྲོག་ཆགས་ཁྲག་ཁྲིག་ཕྲག་བརྒྱད་ཅུས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་གྱུར་ཏོ།
en: Pūrṇa, at that time, the monk Yaśas propagated the teachings of the thus-gone one Merugandha on a vast scale. When he wandered from city to city, he taught the Dharma to sentient beings and benefitted many of them. As a consequence, eight billion beings gave rise to the mind set on unsurpassed and perfect awakening.

source: །དགེ་སློང་ཡ་ཤས་དེ་ལྟར་ཕན་པ་མང་པོ་བྱས་ནས་དེའི་འོག་ཏུ་འཆི་བའི་དུས་བྱས་པ་དང་། དགེ་སློང་ཡ་ཤའི་རྗེས་སུ་ཕྱོགས་པའི་སྐྱེ་བོ་བདུན་ཁྲི་ཡོད་པ་དེ་དག་གིས་དགེ་སློང་ཡ་ཤའི་ཕྱིར་རིང་བསྲེལ་གྱི་མཆོད་རྟེན་བདུན་ཁྲི་བརྩིགས་ནས་སྤོས་དང་། མེ་ཏོག་དང་། སྤོས་ཀྱི་ཕྱེ་མ་དང་། བྱུག་པ་དང་། ཕྲེང་བ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་མང་པོ་སྣ་ཚོགས་ཀྱིས་མཆོད་ཅིང་བཀུར་སྟིར་བྱས། བླ་མར་བྱས་ཤིང་བསྔགས་པ་བརྗོད་པར་གྱུར་ཏོ།
en: “After the monk Yaśas had benefitted many sentient beings in that way, he passed away. At that time seventy thousand of his followers built for him seventy thousand reliquaries that they worshiped, respected, honored, and praised by offering various kinds of perfumes, flowers, fragrant powders, ointments, garlands, parasols, banners, and standards.

source: །གང་པོ་དགེ་སློང་ཡ་ཤས་འཆི་ཀའི་དུས་ཀྱི་ཚེ་སླར་འཛམ་བུའི་གླིང་འདི་ཉིད་དུ་སྐྱེ་བར་གྱུར་ཅིག་ཅེས་སྨོན་ལམ་བཏབ་པས་འཆི་བའི་དུས་བྱས་པའི་འོག་ཏུ་སྨོན་ལམ་བཏབ་པ་བཞིན་དུ་ཡང་རྒྱལ་རིགས་སུ་སྐྱེས་པར་གྱུར་ཏེ་དེའི་ཚེ་ལྷ་མང་པོ་རྣམས་ཀྱིས་སྒྲ་ཆེན་པོ་ཕྱུང་སྟེ།
en: Pūrṇa, just before the monk Yaśas had passed away, he had formed the aspiration to be reborn again within this world. In accordance with his aspiration, he was reborn within the warrior class. When he was born, many gods proclaimed,

source: འདི་སྐད་དུ་ཀྱེ་དེང་རྒྱལ་པོའི་བུ་བཙས་པ་འདི་ནི་སེམས་ཅན་ལ་ཕན་པ་མང་པོ་བྱེད་པ་ཡིན་ནོ་ཞེས་བསྒྲགས་པས། སྒྲ་དེའི་རྗེས་སུ་མིང་ཡང་རབ་ཏུ་འདྲེན་པ་ཞེས་བཏགས་སོ། །དེ་ལོ་བཅུ་བཞི་ལོན་པ་དང་། དེ་བཞིན་གཤེགས་པ་མེ་རོ་གན་དྷ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་འོག་ཏུ་ལོ་ལྔ་བརྒྱ་པའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་བར་གྱུར་ཏོ།
en: ‘Hark! This newborn prince will bring great benefits to sentient beings!’ He therefore became known as Pariṇāyaka. When he was fourteen, he went forth under the teachings of the thus-gone one Merugandha, five hundred years after the latter had passed into complete nirvāṇa.

source: །དགེ་སློང་རབ་ཏུ་འདྲེན་པ་དེ་ཡང་མདོ་སྡེ་དང་། བསྟན་བཅོས་མང་པོ་རྒྱ་ཆེར་ཁ་ཏོན་དུ་འདོན་པ་དང་། མང་དུ་ཐོས་ཤིང་ཟབ་མོ་ལ་འཇུག་པ་དང་། ཚིག་འབྲུ་དང་། སྤོབས་པ་ཡོངས་སུ་དག་པ་དང་། ཆོས་བསྟན་པའི་ཐབས་ལ་རབ་ཏུ་མཁས་པར་གྱུར་ཏོ།
en: The monk Pariṇāyaka recited a great many discourses and treatises, engaged in extensive and profound studies, became an expert in letters, developed perfect eloquence, and mastered the skills of teaching the Dharma.

source: །གང་པོ་དགེ་སློང་རབ་ཏུ་འདྲེན་པ་དེ་གྲོང་རྡལ་གཅིག་ནས་གཅིག་ཏུ། གྲོང་ཁྱེར་གཅིག་ནས་གཅིག་ཏུ། ཡུལ་གཅིག་ནས་གཅིག་ཏུ་རྒྱུ་ཞིང་སོང་ནས། དེ་བཞིན་གཤེགས་པ་མེ་རོ་གན་དྷའི་བསྟན་པ་རྒྱ་ཆེར་སྤེལ་ནས་ཕན་པ་མང་པོ་བྱས་སོ།
en: “Pūrṇa, as the monk Pariṇāyaka wandered from town to town, city to city, and country to country, he propagated the teachings of the thus-gone one Merugandha on a vast scale and benefitted many beings.

source: །དེའི་ཚེ་ད་མ་ཤི་རི་དང་། དྲན་པ་ཐོབ་པ་དང་། ཡ་ཤའི་དགེ་སློང་གི་ཚོགས་རྣམས་གཅིག་ཏུ་འདུས་ནས་རབ་ཏུ་འདྲེན་པའི་ཐད་དུ་འོངས་ཏེ། དེའི་བསྟན་པ་དག་གཞིག་ཅིང་སྐུར་པ་བཏབ་པར་བཤམས་སོ།
en: At that time, the assemblies of monks following Damaśrī, those following Smṛtipratilabdha, and those following Yaśas planned to group together and go meet Pariṇāyaka to refute and disparage his teachings.

source: །དེ་ནས་དེའི་ཚེ་དགེ་སློང་རབ་ཏུ་འདྲེན་པས་དགེ་སློང་མང་པོ་འོངས་པར་རིག་ནས་འདི་སྐད་དུ་ཀྱེ་དགེ་སློང་མང་པོ་ཁྱེད་དངོས་པོ་ཅི་ཞིག་གིས་ནི་རྒོལ་བར་སེམས།
en: When he saw those many monks approaching, the monk Pariṇāyaka asked them, ‘What arguments are you planning to use to oppose my teachings?

source: དངོས་པོ་གང་ཞིག་ནི་འདྲི་བར་སེམས་ཞེས་སྨྲས་པ་དང་། དགེ་སློང་མང་པོ་རྣམས་དེ་སྐད་སྨྲས་པ་ཐོས་ནས་མྱ་ངན་གྱིས་ནོན་ཅིང་མི་བདེ་བར་གྱུར་པས་ཅང་མི་ཟེར་བར་གྱུར་ཏེ། དགེ་སློང་རབ་ཏུ་འདྲེན་པ་ལ་བགེགས་བྱ་བར་ཡང་མ་ནུས་སོ།
en: What are you planning to inquire about?’ When they heard those words, the monks were overcome by distress and sorrow, and they did not answer. As such they were unable to oppose the monk Pariṇāyaka.

source: །གང་པོ་བྱང་ཆུབ་སེམས་དཔའ་དེ་ཇི་སྲིད་དུ་འཇིག་རྟེན་ན་གནས་པ་དེ་སྲིད་དུ་སངས་རྒྱས་ཀྱི་བསྟན་པ་ཡང་རྒྱས་ཤིང་རབ་ཏུ་འཕེལ་བར་གྱུར་ཏོ།
en: “Pūrṇa, as long as that bodhisattva remained in the world, the teachings of the Buddha spread and flourished.

source: །དེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་རྗེས་སུ་སངས་རྒྱས་ཀྱི་བསྟན་པ་ཡང་ནུབ་པར་གྱུར་ཏོ།
en: However, after he passed into complete nirvāṇa, the teachings of the Buddha started to vanish.

source: །དགེ་སློང་རབ་ཏུ་འདྲེན་པ་དེ་མ་འོངས་པའི་དུས་ཐ་མ་ལ་དམ་པའི་ཆོས་ནུབ་ཏུ་ཉེ་བའི་ཚེ་གྲོང་རྡལ་གཅིག་ནས་གཅིག་ཏུ། གྲོང་ཁྱེར་གཅིག་ནས་གཅིག་ཏུ། ཡུལ་གཅིག་ནས་གཅིག་ཏུ་རྒྱུ་ཞིང་སོང་ནས་སེམས་ཅན་མང་པོའི་ཆེད་དུ་ཡོངས་སུ་དག་ཅིང་སྟོང་པ་ཉིད་ཀྱི་རྗེས་སུ་འཐུན་པའི་མདོ་སྡེ་ཟབ་མོ་ཡང་དག་པར་བསྟན་པས་སྲོག་ཆགས་བྱེ་བ་ཕྲག་བརྒྱད་ཅུས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་གྱུར་ཏེ།
en: Toward the end, when the Dharma was about to disappear, the monk Pariṇāyaka wandered from town to town, from city to city, and from country to country, teaching the pure and profound discourses that are in harmony with emptiness, in order to benefit many sentient beings. As a consequence, eight hundred million beings gave rise to the mind set on unsurpassed and perfect awakening.

source: དེ་དག་འཆི་བའི་དུས་བྱས་པའི་འོག་ཏུ་ཐམས་ཅད་ཀྱང་མཐོ་རིས་ལྷའི་འཇིག་རྟེན་དུ་སྐྱེས་པར་གྱུར་ཏོ།
en: After they passed away, all those beings were reborn in the heavens within the world of the gods.

source: །གང་པོ་དགེ་སློང་རབ་ཏུ་འདྲེན་པས་དེ་ལྟར་ཕན་པ་བྱས་ནས་དེ་གང་གི་ནུབ་མོ་འཆི་བའི་དུས་བྱས་པ་དེའི་ཕྱི་དེ་ཉིན་པར་སངས་རྒྱས་ཀྱི་བསྟན་པ་ཡང་ནུབ་པར་གྱུར་ཏོ།
en: Pūrṇa, after having benefitted beings in that way, on the first day following the night when the monk Pariṇāyaka passed away, the teachings of the Buddha vanished.

source: །གང་པོ་དེ་བཞིན་གཤེགས་པ་མེ་རོ་གན་དྷའི་བསྟན་པ་ནུབ་པར་གྱུར་པའི་ཕྱིར་མདོ་སྡེ་ཟབ་མོ་ཡོངས་སུ་དག་ཅིང་སྟོང་པ་ཉིད་ཀྱི་རྗེས་སུ་འཐུན་པའི་ཆོས་རྣམས་ཀྱང་ནུབ་པར་གྱུར་ཏོ།
en: Pūrṇa, since the teachings of the thus-gone one Merugandha had vanished, the teachings of the profound and pure discourses that were in harmony with emptiness also vanished.

source: །གང་པོ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ནི་མདོ་སྡེ་ཟབ་མོ་དེ་ལྟ་བུས་སངས་རྒྱས་ཀྱི་བསྟན་པ་སྲུང་ཞིང་བདག་ཉིད་ཀྱི་དགེ་བའི་རྩ་བ་དང་། བསོད་ནམས་ཀྱང་ཕུན་སུམ་ཚོགས་པར་བྱེད་པ་ཡིན་ནོ།
en: Pūrṇa, that being so, bodhisattva great beings guard the teachings of the buddhas and perfect their roots of virtue and their accumulations of merit by propagating such profound discourses.

source: །གང་པོ་བྱང་ཆུབ་སེམས་དཔའ་རབ་ཏུ་འདྲེན་པ་དེ་འཆི་བའི་དུས་བྱས་པའི་འོག་ཏུ་ཞིང་དེ་ཉིད་ཀྱི་སྟེང་གི་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་བཅུ་པར་སྐྱེས་པར་གྱུར་ཏེ།
en: “Pūrṇa, after the bodhisattva Pariṇāyaka passed away, he was reborn in the tenth universe in the direction of the zenith.

source: དེའི་ཚེ་ཞིང་དེའི་སངས་རྒྱས་ཀྱི་མཚན་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལེགས་པའི་སྤྱན་ཞེས་བྱ་སྟེ།
en: The buddha residing in that realm at that time was the thus-gone one, the worthy one, the perfect buddha called Sunetra.

source: དེའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཚེ་རབས་སྔ་མའི་དགེ་བའི་རྩ་བ་དང་། བསོད་ནམས་ཀྱི་རྒྱུ་དང་རྐྱེན་གྱིས་ཤེས་རབ་ཟབ་ཅིང་གསལ་ལ་རྣོ་བ་དང་། སྤོབས་པ་རྡུགས་པ་མེད་ཅིང་མྱུར་ལ་ཐོགས་པ་མེད་པར་གྱུར་ཏོ།
en: He went forth under this buddha’s teachings and, due to the roots of virtue and merit he had accumulated in his previous lives, his insight was profound, brilliant, and sharp, and his eloquence was inexhaustible, swift, and unobstructed.

source: །དགེ་སློང་རབ་ཏུ་འདྲེན་པ་དེ་དེ་བཞིན་གཤེགས་པ་ལེགས་པའི་སྤྱན་གྱི་བསྟན་པ་ལ་ལོ་བརྒྱད་ཁྲི་བཞི་སྟོང་གི་བར་དུ་དགེ་བའི་ཆོས་རྣམས་མངོན་པར་བསྒྲུབས་ནས་འཆི་བའི་དུས་བྱས་པ་དང་། སླར་ཡང་དེ་ཉིད་དུ་དེ་བཞིན་གཤེགས་པ་རབ་ཏུ་འཕེལ་བའི་དཔུང་པ་ཞེས་བྱ་བ་དང་ཕྲད་པར་གྱུར་ནས་སངས་རྒྱས་དེའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་སྟེ།
en: For eighty-four thousand years, the monk Pariṇāyaka created virtue by practicing under the teachings of the thus-gone one Sunetra. After he passed away, he was born once again within that same realm, where he encountered the thus-gone one called Expanding Arm, and he subsequently went forth under his teachings.

source: དགེ་བའི་རྩ་བ་རྣམས་མངོན་པར་བསྒྲུབས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡོངས་སུ་གཉེར་བར་གྱུར་ཏོ།
en: Having created roots of virtue, he pursued unsurpassed and perfect awakening.

source: །དེ་ནས་འཆི་བའི་དུས་བྱས་པའི་འོག་ཏུ་སླར་ཡང་ཞིང་དེ་ཉིད་དུ་སྐྱེས་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གདོན་མི་ཟ་བའི་སྤྱོད་པ་དང་ཕྲད་པར་གྱུར་ཏེ།
en: After he passed away, he was reborn yet again within the same field, only this time in the presence of the thus-gone one, the worthy one, the perfect buddha Fruitful Conduct.

source: སངས་རྒྱས་དེའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ལོ་བདུན་ཁྲིའི་བར་དུ་ནན་ཏན་བརྩོན་འགྲུས་ཀྱིས་དགེ་བའི་རྩ་བ་མངོན་པར་བསྒྲུབས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡོངས་སུ་གཉེར་བར་གྱུར་ཏོ།
en: He then went forth under his teachings, and for the next seventy thousand years he created roots of virtue with persistent diligence and pursued unsurpassed and perfect awakening.

source: །དེའི་ཚེ་དེའི་མིང་ནི་ཤུ་ལ་ཞེས་བྱ་སྟེ།
en: He was then called Śula.

source: དེ་བཞིན་གཤེགས་པ་གདོན་མི་ཟ་བའི་སྤྱོད་པ་དེས་འདི་སྐད་དུ་ང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་འོག་ཏུ་དགེ་སློང་ཤུ་ལ་འདི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ།
en: The thus-gone one Fruitful Conduct prophesied, ‘After I pass into complete nirvāṇa, this monk Śula will awaken to unsurpassed and perfect buddhahood.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཐོགས་པ་མི་མངའ་བའི་སྤྱན་ཞེས་བྱ་བར་འགྱུར་རོ་ཞེས་ལུང་བསྟན་ཏོ།
en: He will become a thus-gone one, a worthy one, a perfect buddha called Unimpeded Vision.’

source: །གང་པོ་བྱང་ཆུབ་སེམས་དཔའ་གང་ཆོས་གསུམ་པ་འདི་དང་ལྡན་པར་གྱུར་ན་ཡོན་ཏན་ཕུན་སུམ་ཚོགས་པ་ཐམས་ཅད་རབ་ཏུ་འཐོབ་པར་འགྱུར་རོ།
en: “Pūrṇa, bodhisattvas who possess this third quality will achieve all excellent qualities.”

source: །དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་དོན་འདི་ཉིད་རབ་ཏུ་གསལ་བར་བསྟན་པའི་ཕྱིར་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ།
en: At that moment, the Blessed One uttered these verses to explain this clearly:

source: བྱང་ཆུབ་སེམས་དཔའ་ཟབ་མོ་ཡི། །རྣམ་དག་ངེས་པའི་ཆོས་ཐོས་ནས།
en: “When bodhisattvas hear the profound, Pure, and definitive Dharma,

source: །བདག་ཉིད་དེ་ལ་གནས་བྱེད་ཅིང་།
en: They follow it

source: །གཞན་དག་ལ་ཡང་སྟོན་པར་བྱེད།
en: And teach it to others.

source: །འཇིག་རྟེན་གཏིང་ནི་མི་དཔོགས་ཀྱང་།
en: “Although the world does not fathom its depths,

source: །བྱང་ཆུབ་སེམས་དཔའ་བྱིང་མི་འགྱུར།
en: The bodhisattvas do not sink.

source: །ཚུལ་ཁྲིམས་རྣམ་དག་རབ་གནས་ནས།
en: Maintaining a pure discipline,

source: །རྒྱ་ཆེར་སེམས་ཅན་ཕན་ཡང་འདོགས།
en: They benefit sentient beings on a vast scale. “Since the buddhas taught their retinues

source: །གླེང་གཞི་དང་ནི་རྟོགས་པ་བརྗོད།
en: That the narratives and biographies

source: །སངས་རྒྱས་ལམ་ཞེས་འཁོར་ལ་སྟོན། །སངས་རྒྱས་རྣམས་ཀྱིས་གསུངས་པས་ན།
en: Illustrate the path to buddhahood,

source: །འདི་ནི་ངེས་པའི་ཆོས་ཡིན་ནོ།
en: They are definitely the Dharma.

source: །བྱང་ཆུབ་སེམས་དཔའ་ཕན་སྤྱོད་པ།
en: “Altruistic bodhisattvas

source: །སེམས་ཅན་ལ་ནི་ཕན་ཡང་འདོགས།
en: Accomplish the benefit of sentient beings.

source: །སངས་རྒྱས་ཆོས་རྣམས་སྲུང་བྱེད་ཅིང་།
en: They preserve the Dharma teachings of the buddhas

source: །འཁོར་ལ་བྱང་ཆུབ་འདེམས་པར་བྱེད།
en: And transmit awakening to their retinues.

source: །སེམས་ཅན་དག་གི་ཆོས་བཞིན་དོན། །བྱང་ཆུབ་སེམས་དཔས་ཐམས་ཅད་བྱེད།
en: “Bodhisattvas accomplish the benefit of sentient beings In accordance with the Dharma.

source: །འཁོར་ལ་སངས་རྒྱས་ལམ་སྟོན་པས།
en: They teach the path of the buddhas to their retinues,

source: །བྱང་ཆུབ་སེམས་ནི་ཉེ་བར་འགྱུར།
en: Who come closer to the mind set on awakening.

source: །སངས་རྒྱས་ལམ་ནི་སྲུང་བྱེད་ཅིང་།
en: “Since they guard the path of the buddhas

source: །སེམས་ཅན་རྒྱ་ཆེར་ཕན་འདོགས་པས།
en: And benefit sentient beings on a vast scale,

source: །ལྷ་དང་ཀླུ་དང་འདྲེ་སྲིན་དང་། །གང་ཟག་ཆེན་པོས་བཀུར་བར་འགྱུར།
en: They will be revered by the gods, nāgas, Demons, and rākṣasas, as well as the great beings.

source: །དེ་ཕྱིར་རྣམ་པར་དག་པ་ཡི།
en: “Therefore, if bodhisattvas, upon hearing

source: །སྟོང་ཟབ་གྱ་ནོམ་ཆོས་ཐོས་ནས།
en: The excellent Dharma related to profound and pure emptiness,

source: །རྩེ་གཅིག་སེམས་ཤིང་གཉེར་བྱེད་ན།
en: Contemplate it and pursue it one-pointedly,

source: །གཞན་ཡང་གང་པོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ནི་སྤྱོད་པ་རྣམས་ཕུན་སུམ་ཚོགས་པར་བྱེད་དེ། སྤྱོད་པ་རྣམས་ཕུན་སུམ་ཚོགས་པར་གྱུར་བའི་ཕྱིར་དགེ་བའི་རྩ་བ་དང་། བསོད་ནམས་ཕུན་སུམ་ཚོགས་པར་བྱེད་པར་འགྱུར་རོ།
en: “Furthermore, Pūrṇa, (4) since bodhisattva great beings engage in perfect conduct, this sublime conduct will also perfect their roots of virtue and develop excellent merit.

source: །དེ་ལ་སྤྱོད་པ་གང་ཞེ་ན།
en: What is meant by conduct?

source: གང་པོ་བྱང་ཆུབ་སེམས་དཔའ་ནི་དགེ་བའི་བཤེས་གཉེན་ལ་བརྟེན་ནས་སྦྱིན་པ་ཡོངས་སུ་གཏོང་བར་བྱེད། ཚུལ་ཁྲིམས་སྲུང་བར་བྱེད། བཟོད་པ་སྒོམ་པར་བྱེད། བརྩོན་འགྲུས་རྩོམ་པར་བྱེད། བསམ་གཏན་ལ་མཉམ་པར་འཇོག་པར་བྱེད། ཤེས་རབ་དང་ཐབས་མཁས་པ་སྒོམ་པར་བྱེད་དོ།
en: Pūrṇa, relying on their virtuous friends, bodhisattvas practice generosity, guard their discipline, cultivate patience, undertake diligence, rest in concentration, and develop their insight as well as their skillful means.

source: །བྱང་ཆུབ་སེམས་དཔའི་དགེ་བའི་བཤེས་གཉེན་གང་ཞེ་ན།
en: Who are the virtuous friends of bodhisattvas?

source: བྱང་ཆུབ་སེམས་དཔས་གང་ལས་མདོ་སྡེ་དེ་ལྟ་བུ་དག་རྗེས་སུ་བསྟན་པའི་ཐབས་མཁས་པ་འཐོབ་པར་འགྱུར་བ།
en: They are those from whom bodhisattvas receive the skillful means taught in the discourses.

source: སངས་རྒྱས་དང་། ཉན་ཐོས་དང་། ལྷག་པའི་བསམ་པས་བྱང་ཆུབ་དོན་དུ་གཉེར་བར་བྱེད་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ནི་བྱང་ཆུབ་སེམས་དཔའི་དགེ་བའི་བཤེས་གཉེན་ཞེས་བྱ་སྟེ།
en: All the buddhas, hearers, and bodhisattvas who pursue awakening through their extraordinary resolve are referred to as the virtuous friends of bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའ་གང་ཆོས་བཞི་པ་འདི་དང་ལྡན་པར་གྱུར་ན་ཡོན་ཏན་ཕུན་སུམ་ཚོགས་པ་ཐམས་ཅད་རབ་ཏུ་འཐོབ་པར་འགྱུར་རོ།
en: Bodhisattvas who possess this fourth quality will achieve all excellent qualities.”

source: ངས་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས།
en: “I have explained to bodhisattvas

source: །སྤྱད་པར་བྱ་བའི་ཆོས་དག་ནི།
en: That what should be practiced

source: །སྦྱིན་པ་བཏང་ནས་རབ་དགའ་ཞིང་།
en: Is generosity, accompanied by utter joy

source: འགྱོད་པ་མེད་པ་ཡིན་ཞེས་བཤད།
en: And no feeling of regret.

source: །དེ་ལ་དགའ་བ་གང་ཞེ་ན།
en: “What is meant by joy?

source: །དགའ་བས་ལུས་ཀུན་ཁྱབ་པ་ཡིན།
en: It means that their bodies are filled with joy.

source: །རྟག་ཏུ་དགའ་སེམས་འདི་ཡིས་ནི། །བྱང་ཆུབ་ལམ་ནི་སྤྱད་པར་བྱ།
en: Bodhisattvas should always practice on the path of awakening With this joyful attitude.

source: །བྱང་ཆུབ་སེམས་དཔས་སྦྱིན་བཏང་ནས།
en: “If bodhisattvas, after practicing generosity,

source: །བྱང་ཆུབ་ཏུ་ནི་སྔོ་བྱེད་ཅིང་།
en: Dedicate this merit to awakening

source: །སེམས་ཅན་རྣམས་ལ་ཕན་འདོགས་ན།
en: And accomplish the benefit of sentient beings,

source: །རང་དོན་དཔག་མེད་ཐོབ་པར་འགྱུར།
en: They will themselves be benefitted in ways that cannot be fathomed.

source: །སློང་བ་དག་ནི་མཐོང་གྱུར་ན།
en: “When bodhisattvas see a beggar,

source: །སངས་རྒྱས་འདུ་ཤེས་རབ་བསྐྱེད་དེ།
en: They perceive him as a buddha and think,

source: །དེ་རིང་འདིར་ནི་འདི་འོངས་པས།
en: ‘This person approached me today

source: །བདག་ལ་བྱང་ཆུབ་ལམ་ཡང་བྱིན།
en: And offered me the path of awakening.

source: །བདག་ནི་འདི་ཡི་དབང་གིས་ན། །རྣམ་དག་ཞིང་ནི་ཐོབ་པར་འགྱུར།
en: “ ‘As a consequence, I will reach the pure fields.

source: །འདི་ཡིས་བདག་ལ་སངས་རྒྱས་བསྟན།
en: This person has revealed to me the Buddha

source: །བདག་ལ་སངས་རྒྱས་ལམ་སྟོན་བྱེད།
en: And is teaching me the path to buddhahood.

source: །དེང་བདག་འདི་དང་ཕྲད་པས་ན།
en: “ ‘By meeting this person today,

source: །རྙེད་པ་ཆེན་པོ་རབ་རྙེད་ཅེས།
en: I will receive a very great gain!’

source: །དགའ་བས་ལུས་ཀུན་ཁྱབ་ནས་ནི།
en: With their bodies filled with joy,

source: །དངོས་པོ་གཞན་ལ་མོས་མི་བྱེད།
en: They do not wish for anything else.

source: །དགའ་ཞིང་དྲུང་དུ་འོངས་གྱུར་ན།
en: “If someone were to approach them,

source: །རྒྱང་ནས་གསོང་པོར་སྨྲ་བར་བྱེད།
en: They would greet this person from a distance

source: །ཁྱོད་ནི་དངོས་པོ་ཅི་ཞིག་འདོད། །བདག་གིས་ཟད་པར་སྦྱིན་ཞེས་ཟེར།
en: And say, ‘What do you need? I will give you anything!’

source: །གལ་ཏེ་དགོས་པ་མེད་ཟེར་ན།
en: “If this person answered, ‘I do not need anything,’

source: །བྱང་ཆུབ་སེམས་དཔའ་རབ་དགའ་ཞིང་།
en: The bodhisattvas would be delighted and think,

source: །འདིས་བདག་གདུལ་བར་འདོད་པའི་ཕྱིར། །དགོས་པ་མེད་ཅེས་ཟེར་བར་ཟད།
en: ‘This person simply said those words Because he wants to guide me.

source: །འཕགས་པ་འདིས་ནི་གང་མོས་པའི།
en: “ ‘What interests this noble being

source: །འདོད་ཉུང་ཆོག་ཤེས་ཆོས་ཀྱིས་ནི།
en: Is the Dharma teaching of having few desires and contentment.

source: །འདིར་འོངས་བདག་ལ་གོ་བྱས་ནས།
en: He has come here today and instructed me in it

source: །བྱང་ཆུབ་རྐྱེན་ནི་ཐོབ་པར་བྱེད།
en: To provide me with the circumstance leading to awakening.

source: །དེང་བདག་གང་ཟག་འདི་ཡི་རྒྱུས།
en: “ ‘Thanks to this person,

source: །རྗེས་སུ་བསྟན་པའི་ཆོས་ཀྱང་ཐོབ།
en: I have now received the Dharma.

source: །ཁྱེད་ཀྱིས་དགོས་མེད་གང་སྨྲས་པ།
en: As you say, “I do not need anything,”

source: །ཚིག་འདི་ལེགས་པ་ཡིན་ཞེས་ཟེར།
en: Those are excellent words!’

source: །དངོས་པོ་འདི་ནི་འདོད་ཟེར་ཞིང་།
en: “But if this person answered,

source: །བདག་ལ་བྱིན་ཅིག་ཟེར་ན་ཡང་།
en: ‘I need such and such; please give it to me!’

source: །བྱང་ཆུབ་སེམས་དཔས་ཅི་བདོག་པ། །ཐམས་ཅད་དགའ་བས་ཁྱེར་ཞེས་ཟེར།
en: The bodhisattvas would joyfully Offer whatever they possess.

source: །གལ་ཏེ་སྦྱིན་པ་བཏང་ནས་ནི། །ཕྱིས་ཀྱང་འགྱོད་པ་མེད་གྱུར་ན། །སངས་རྒྱས་ལམ་ནི་དྲན་པའི་ཕྱིར། །སེམས་ནི་རྟག་ཏུ་དགའ་བ་འཐོབ།
en: “If they do not give rise to regrets After practicing generosity, Their minds will always be joyful, Since they have recollected the path of the Buddha.

source: །སེམས་ཅན་ཀུན་ལ་སྐལ་ཡོད་པས། །ཐམས་ཅད་ཕོངས་པ་མེད་འགྱུར་ཞིང་། །མ་ལུས་ཐམས་ཅད་ཚིམ་བྱ་ཞེས། །སྦྱིན་པ་གཏོང་ཚེ་སྔོ་བར་བྱེད།
en: “When they practice generosity, they dedicate the merit thus: ‘Since all sentient beings are deserving, I will free them all from poverty And satisfy them all.’

source: །བྱང་ཆུབ་ལམ་ནི་སྤྱོད་པའི་ཚེ།
en: “Practicing the path of awakening, they make this aspiration:

source: །སེམས་ཅན་བདག་གི་མིང་ཐོས་པ།
en: ‘May sentient beings who hear my name

source: །རང་གི་ངང་གིས་ཆོག་ཤེས་ཤིང་།
en: Naturally become content

source: །སེར་སྣ་ཆགས་སེམས་མེད་པར་ཤོག
en: And free from miserliness and attachment.

source: །བདག་གི་ཡུལ་གྱི་སེམས་ཅན་ཀུན། །ལམ་སྤྱོད་ཐམས་ཅད་ཆོག་ཤེས་ཤིང་། །འདོད་ལྔ་ཆགས་པ་ཀུན་སྤངས་ནས། །ཐམས་ཅད་རབ་འབྱུང་མོས་པར་ཤོག
en: “ ‘May all beings in my country, Who practice the path, become content, Give up their attachment to the five sense pleasures, And aspire to go forth. “

source: །དེ་འདྲའི་སྤྱོད་པ་ཚད་མེད་དང་། །སྦྱིན་པ་ཡོངས་སུ་བསྔོས་པ་ཡིས། །རྟག་པར་སྦྱིན་པ་རབ་གཏོང་ཞིང་། །སེམས་ཅན་བདག་རྗེས་སློབ་པར་ཤོག
en: ‘Through such boundless conduct And the dedication of this generosity, May I always be generous, And may all beings follow in my footsteps.’

source: །བྱང་ཆུབ་སེམས་དཔས་སྦྱིན་གཏོང་ཚེ། །བྱམས་སེམས་སེམས་ཅན་ཁྱབ་པས་ན།
en: “When bodhisattvas practice generosity, Their love touches all sentient beings.

source: །འཇིག་རྟེན་དག་ནི་ཐམས་ཅད་ན། །དེ་འདྲའི་བདེ་བ་ཡོང་མེད་དོ།
en: Therefore, within all worlds, There is no comparable happiness.

source: །དཔེར་ན་ཁྱིམ་བདག་ཕྱུག་པོ་ཞིག །ནོར་དང་རིན་ཆེན་ཤིན་ཏུ་མང་།
en: “Take the example of a rich, Wealthy, and prosperous householder

source: །བུ་ནི་གཅིག་ཅིག་ཡོད་པ་ལས། །ལོ་ནི་མང་པོར་ལམ་རིང་སོང་།
en: Who has but a single son, Who has been far away for many years.

source: །ཁྱིམ་བདག་བུ་འོངས་ཐོས་གྱུར་ནས། །དགའ་བས་ལུས་ཀུན་ཁྱབ་འགྱུར་ཞིང་།
en: “Hearing that his son is coming home, The whole body of that householder is filled with joy.

source: །ཡུན་རིང་ལོན་ནས་དེང་འོངས་ཤེས། །ད་གདོད་བཙས་བཞིན་རབ་ཏུ་དགའ།
en: Knowing that his son is finally returning, He is as thrilled as when his son was born.

source: །བྱང་ཆུབ་སེམས་དཔས་སློང་མཐོང་ན། །དེ་ཡི་སེམས་ནི་རབ་ཏུ་དགའ།
en: “Likewise, when bodhisattvas see beggars, Their minds become utterly delighted.

source: །ཁྱིམ་བདག་དེའི་དགའ་བས་ནི། །བཅུ་དྲུག་ཆར་ཡང་མི་ཕོད་དོ།
en: Yet the joy experienced by the householder Does not match even a sixteenth fraction of their delight.

source: །སྦྱིན་པ་གཏོང་བར་ཐོས་གྱུར་ན།
en: “When they hear about someone practicing generosity,

source: །དེ་ཡི་སེམས་ནི་རབ་དགའ་བས།
en: Their minds become utterly delighted.
